src/Catalogs/СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствияПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорядокПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолеПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.ЗначенияЗаполнения.Свойство("ОбъектЗагрузки") Тогда
		Если ТипЗнч(Параметры.ЗначенияЗаполнения.ОбъектЗагрузки) = Тип("Строка") Тогда
			ОбъектЗагрузки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Параметры.ЗначенияЗаполнения.ОбъектЗагрузки, Ложь);
		Иначе
			ОбъектЗагрузки = Параметры.ЗначенияЗаполнения.ОбъектЗагрузки;
		КонецЕсли;
		Объект.ОбъектЗагрузки =ОбъектЗагрузки;
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Наименование") Тогда
		Объект.Наименование = Параметры.ЗначенияЗаполнения.Наименование;
	КонецЕсли;  
	
	Если Параметры.ЗначенияЗаполнения.Свойство("СоответствияПолей") Тогда
		Для каждого строка Из Параметры.ЗначенияЗаполнения.МаппингПолей Цикл
			НоваяСтрока = Объект.СоответствияПолей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, строка);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеМетоды

&НаКлиенте
Процедура ПоляСоответствияВТабличнуюЧасть(ДобавляемыеПоля)
	
	ПараметрыОтбора = Новый Структура;
	Для каждого ЭлементСоответствия Из ДобавляемыеПоля Цикл
		
		ИмяПоляОтбора = ?(ТипЗнч(ЭлементСоответствия.Ключ) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"), "ДополнительныйРеквизит", "ИмяПоля");
		
		ПараметрыОтбора.Очистить();
		ПараметрыОтбора.Вставить(ИмяПоляОтбора, ЭлементСоответствия.Ключ);
		
		Если Объект.СоответствияПолей.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = Объект.СоответствияПолей.Добавить();
		НоваяСтрока[ИмяПоляОтбора] = ЭлементСоответствия.Ключ;
		НоваяСтрока.ПредставлениеПоля = ЭлементСоответствия.Значение;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДоступныеПоляЗагрузкиДанныхИзВнешнегоИсточника()
	
	Объект.СоответствияПолей.Очистить();
	
	ДоступныеПоляЗагрузки = Справочники.СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника.ДоступныеПоляЗагрузкиДанныхИзВнешнегоИсточника(Объект.ОбъектЗагрузки, "", Истина);
	Для каждого ЭлементСтруктуры Из ДоступныеПоляЗагрузки Цикл
		
		НоваяСтрока = Объект.СоответствияПолей.Добавить();
		НоваяСтрока.ИмяПоля = ЭлементСтруктуры.Ключ;
		НоваяСтрока.ПредставлениеПоля = ЭлементСтруктуры.Значение;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЭлементыФормы

&НаКлиенте
Процедура ОбъектЗагрузкиПриИзменении(Элемент)
	
	Объект.СоответствияПолей.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ДобавитьПоле(Команда)
	
	ВыбранныеПоля = Новый Массив;
	Для каждого СтрокаТаблицы Из Объект.СоответствияПолей Цикл
		
		ВыбранныеПоля.Добавить(?(ПустаяСтрока(СтрокаТаблицы.ИмяПоля), СтрокаТаблицы.ДополнительныйРеквизит, СтрокаТаблицы.ИмяПоля));
		
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыбранныеПоля", ВыбранныеПоля);
	ПараметрыОткрытия.Вставить("ОбъектЗагрузки", Объект.ОбъектЗагрузки);
	ПараметрыОткрытия.Вставить("ИмяТабличнойЧасти", Объект.ИмяТабличнойЧасти);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаДобавленныхПолей", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.СоответствиеПолейЗагрузкиДанныхИзВнешнегоИсточника.Форма.ФормаПодбораПолей", ПараметрыОткрытия, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленныхПолей(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПоляСоответствияВТабличнуюЧасть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПустую(Команда)
	
	НоваяСтрока = Объект.СоответствияПолей.Добавить();
	НоваяСтрока.ИмяПоля = Неопределено;
	НоваяСтрока.ПредставлениеПоля = НСтр("ru ='Не используется'");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоля(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗаполненияПолей", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru ='Табличная часть будет очищена и заполнена заново. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаполненияПолей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ДоступныеПоляЗагрузкиДанныхИзВнешнегоИсточника();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
